Repository: LeoAiolia/qrcode_pro
Catalog: QRScanPro/Shared/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en

source: %lld 张未识别
en: %lld Unrecognized

source: %lld 条已识别
en: %lld Recognized

source: 30 天
en: 30 Days

source: 90 天
en: 90 Days

source: Logo 占比
en: Logo Ratio

source: Logo 占比过大
en: Logo ratio too large

source: Logo 读取失败：%@
en: Failed to Load Logo: %@

source: sRGB Hex颜色
en: sRGB Hex Color

source: 二维码图片渲染失败
en: QR code image rendering failed

source: 二维码生成器初始化失败
en: QR code generator initialization failed

source: 仅今天
en: Today Only

source: 今天
en: Today

source: 从相册选择图片识别
en: Choose from Photos

source: 以内
en: or less

source: 保存到历史失败：%@
en: Failed to Save to History: %@

source: 保存到生成历史
en: Save to History

source: 保存到相册
en: Save to Photos

source: 保存到相册失败：%@
en: Failed to save to Photos: %@

source: 保存历史
en: Save to History

source: 信息
en: Info

source: 光谱
en: Spectrum

source: 全部复制
en: Copy All

source: 关于
en: About

source: 关灯
en: Torch Off

source: 关闭
en: Close

source: 关闭闪光灯
en: Turn Off Torch

source: 内容
en: Content

source: 写入失败：%@
en: Write failed: %@

source: 分享
en: Share

source: 删除
en: Delete

source: 删除 %lld 条记录？
en: Delete %lld Records?

source: 删除(%lld)
en: Delete (%lld)

source: 删除记录
en: Delete Record

source: 删除选中(%lld)
en: Delete Selected (%lld)

source: 前后景对比度过低
en: Low contrast

source: 前景色
en: Foreground Color

source: 历史
en: History

source: 历史保留时长
en: History Retention

source: 历史记录
en: History

source: 历史记录写入失败：%@
en: Failed to write history record: %@

source: 原始内容
en: Original Content

source: 取消
en: Cancel

source: 图片
en: Image

source: 图片无法读取
en: Cannot read image

source: 图片识别
en: Recognize Image

source: 图片识别失败：%@
en: Image recognition failed: %@

source: 圆形
en: Circle

source: 圆角
en: Rounded

source: 在浏览器中打开
en: Open in Browser

source: 复制
en: Copy

source: 复制内容
en: Copy Content

source: 外观
en: Appearance

source: 外边距：%lld 模块
en: Margin: %lld modules

source: 完成
en: Done

source: 对比度
en: Contrast

source: 导出
en: Export

source: 导出 CSV
en: Export CSV

source: 导出失败：%@
en: Export Failed: %@

source: 导出失败：编码错误
en: Export Failed: Encoding Error

source: 将二维码 / 条形码放入框内自动识别
en: Place QR code / barcode in frame to scan

source: 尺寸 / 边距 / 纠错
en: Size / Margin / Error Correction

source: 已保存到相册
en: Saved to Photos

source: 已加入生成历史
en: Added to History

source: 已取消导出
en: Export cancelled

source: 已复制
en: Copied

source: 已复制 %d 条
en: Copied %d Items

source: 已复制 PNG 到剪贴板
en: Copied PNG to Clipboard

source: 已导出到 %@
en: Exported to %@

source: 已识别：%@
en: Recognized: %@

source: 建议 ≥ 3.0，扫码可能失败
en: ≥ 3.0 recommended. Scanning may fail.

source: 开灯
en: Torch On

source: 当前设备不支持相机扫码
en: Camera scanning not supported

source: 形状与配色
en: Shape & Color

source: 打开网页
en: Open Link

source: 打开闪光灯
en: Turn On Torch

source: 扫描
en: Scanning

source: 扫描结果
en: Scan Result

source: 扫描结果保存失败：%@
en: Failed to save scan result: %@

source: 扫一扫
en: Scan

source: 打开扫一扫
en: Open Scanner

source: 打开生成二维码
en: Open QR Code Generator

source: 打开 QRScan Pro 开始扫码
en: Open QRScan Pro to scan QR codes and barcodes.

source: 打开 QRScan Pro 生成二维码
en: Open QRScan Pro to generate QR codes.

source: 扫码
en: Scan

source: 扫码 · 识别 · 生成
en: Scan · Recognize · Generate

source: 扫码可能失败，建议降低到
en: Scanning may fail. Reduce to

source: 拖入图片到此处
en: Drop Image Here

source: 振动反馈
en: Vibration Feedback

source: 搜索内容
en: Search Content

source: 支持 PNG / JPEG / HEIC 等常见格式，识别成功结果自动写入扫码历史。
en: Supports PNG / JPEG / HEIC. Recognized results are saved to scan history automatically.

source: 方形
en: Square

source: 昨天
en: Yesterday

source: 暂无历史记录
en: No History Yet

source: 暂无日志
en: No Logs

source: 更多操作
en: More Actions

source: 更换 Logo
en: Change Logo

source: 更换 Logo…
en: Change Logo…

source: 未在图片中识别到二维码或条形码
en: No QR code or barcode recognized in image

source: 未授予相册写入权限，请在「设置」中开启
en: Photo library write access denied. Enable it in Settings.

source: 未知错误
en: Unknown error

source: 未识别到二维码 / 条形码
en: No QR code / barcode recognized

source: 松手以识别
en: Release to Recognize

source: 检测到网页链接
en: Web Link Detected

source: 每次询问
en: Ask Every Time

source: 永久
en: Forever

source: 浅色
en: Light

source: 深色
en: Dark

source: 清空
en: Clear

source: 清空全部
en: Clear All

source: 清空全部历史记录？
en: Clear All History?

source: 滑块
en: Sliders

source: 版本
en: Version

source: 生成
en: Generate

source: 生成二维码
en: Generate QR Code

source: 由 Vision 框架驱动
en: Powered by Vision

source: 相册
en: Photos

source: 相机
en: Camera

source: 相机初始化失败：%@
en: Camera initialization failed: %@

source: 相机权限未授权，请在「设置」中开启相机权限。
en: Camera access denied. Enable it in Settings.

source: 相机权限状态未知
en: Unknown camera permission status

source: 码制
en: Barcode Types

source: 码制,来源,内容
en: Kind,Source,Content

source: 码点形状
en: Dot Shape

source: 移除 Logo
en: Remove Logo

source: 等待生成…
en: Generating…

source: 简体中文
en: Simplified Chinese

source: 纠错级别
en: Error Correction Level

source: 编辑
en: Edit

source: 网格
en: Grid

source: 背景色
en: Background Color

source: 设置
en: Settings

source: 识别 / 生成码制
en: Recognize / Generate Types

source: 识别中…
en: Recognizing…

source: 识别结果（%lld / %lld 条）
en: Results (%lld / %lld)

source: 语言
en: Language

source: 请先在设置中启用至少一种码制
en: Enable at least one barcode type in Settings

source: 请在下方输入内容
en: Enter content below

source: 请在左侧输入内容
en: Enter content on the left

source: 请输入需要生成二维码的内容
en: Enter content to generate a QR code

source: 调试日志
en: Debug Log

source: 警告
en: Warning

source: 跟随系统
en: System

source: 输入文本、网址、Wi-Fi 信息等
en: Enter text, URL, Wi-Fi info, etc.

source: 输出尺寸：%lld px
en: Output Size: %lld px

source: 连续扫描
en: Continuous Scan

source: 连续扫描中
en: Continuous Scan

source: 选择
en: Choose

source: 选择 Logo
en: Choose Logo

source: 选择 Logo…
en: Choose Logo…

source: 选择…
en: Choose…

source: 选择图片
en: Select Images

source: 选择图片…
en: Select Images…

source: 通用
en: General

source: 错误
en: Error

source: 闪光灯切换失败：%@
en: Failed to toggle torch: %@

source: 隐私政策
en: Privacy Policy

source: 音效反馈
en: Sound Feedback

source: 默认导出格式
en: Default Export Format

source: 默认导出目录
en: Default Export Directory
